package chap7;



/*
 * ???òï ?à´?ûê Ï∂úÎ†•?ïòÍ∏?
 * [Í≤∞Í≥º]
     ?ûêÎ¶¨ÏàòÎ•? ?ûÖ?†•?ïò?Ñ∏?öî(1~10)
   5
   0 Î∂??Ñ∞ 9ÍπåÏ? 5?ûêÎ¶? ?à´?ûêÎ•? ?ûÖ?†•?ïò?Ñ∏?öî
   12345
   
  * *** *** * * *** 
  *   *   * * * *   
  * *** *** *** *** 
  * *     *   *   * 
  * *** ***   * *** 
 */

import java.util.Scanner;

public class Exam8 {
	public static String[][][] number = { 
		{ // 0
			{ "*", "*", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", "*", "*", " " },
		},
		{ // 1
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " }, 
		},
		{ // 2
			{ "*", "*", "*", " " },
			{ " ", " ", "*", " " },
			{ "*", "*", "*", " " },
			{ "*", " ", " ", " " },
			{ "*", "*", "*", " " }, 
		},
		{ // 3
			{ "*", "*", "*", " " },
			{ " ", " ", "*", " " },
			{ "*", "*", "*", " " },
			{ " ", " ", "*", " " },
			{ "*", "*", "*", " " }, 
		},
		{ // 4
			{ "*", " ", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", "*", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " }, 
		},
		{ // 5
			{ "*", "*", "*", " " },
			{ "*", " ", " ", " " },
			{ "*", "*", "*", " " },
			{ " ", " ", "*", " " },
			{ "*", "*", "*", " " }, 
		},
		{ // 6
			{ "*", "*", "*", " " },
			{ "*", " ", " ", " " },
			{ "*", "*", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", "*", "*", " " }, 
		},
		{ // 7
			{ "*", "*", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " }, 
		},
		{ // 8
			{ "*", "*", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", "*", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", "*", "*", " " }, 
		},
		{ // 9
			{ "*", "*", "*", " " },
			{ "*", " ", "*", " " },
			{ "*", "*", "*", " " },
			{ " ", " ", "*", " " },
			{ " ", " ", "*", " " }, 
		}
	};
	
	public static void main(String[] args) {
		
		final int NUMBER_WIDTH = 4;
		final int NUMBER_HEIGHT = 5;
		
		Scanner scan = new Scanner(System.in);
		
		System.out.println("?ûêÎ¶¨ÏàòÎ•? ?ûÖ?†•?ïò?Ñ∏?öî(1~10)");
		int numberScope = scan.nextInt();
		String[][][] resultStringArray = new String[numberScope][][];
		System.out.println("0 Î∂??Ñ∞ 9ÍπåÏ? "+numberScope+" ?ûêÎ¶¨Ïàò ?à´?ûêÎ•? ?ûÖ?†•?ïò?Ñ∏?öî");
		String inputString = scan.next();
		for(int i = 0; i < inputString.length();i++) {
			resultStringArray[i] = number[inputString.charAt(i)-'0'];
		}
		for(int i = 0; i < NUMBER_HEIGHT;i++) {
			for(int j = 0; j < resultStringArray.length;j++) {
				for(int k = 0; k < NUMBER_WIDTH;k++) {
					System.out.print(resultStringArray[j][i][k]);
				}
			}
			System.out.println();
		}
		
    }
}
