package test;

/*
국어, 영어, 수학, 물리, 화학, 사회, 컴퓨터 점수를  입력받은 후, 총점, 평균을 구하고 이들 모두에 대한 
막대그래프를 아래 조건에 맞게 그릴 수 있는 프로그램을 작성하시오.
단 평균은 소숫점이하는 버리고 정수로 처리 합니다.

[결과]
국어 영어 수학 물리 화학 사회 컴퓨터 점수를(1 - 100) 입력하세요
88 77 99 44 55 66 100

총합 :529
평균 :75
최대 :100
최소 :44

100                           *   *        
 90           *               *   *        
 80   *       *               *   *        
 70   *   *   *               *   *       *
 60   *   *   *           *   *   *       *
 50   *   *   *       *   *   *   *       *
 40   *   *   *   *   *   *   *   *   *   *
 30   *   *   *   *   *   *   *   *   *   *
 20   *   *   *   *   *   *   *   *   *   *
 10   *   *   *   *   *   *   *   *   *   *
       국어  영어  수학  물리  화학  사회 컴퓨터  최대  최소  평균
*/

public class Exam1 {
	public static void main(String[] args) {
	}
}
